package com.example.cardtest;

import com.loopeer.cardstack.CardStackView;

public class Data {
    static String[] Nodes ={ "体检中心","操场","校门北口","银杏景观","邯郸音乐厅","图书馆","餐厅","信息学部","花园景观","校门东口","网计学院","校门南口"};
    public static String[] info={"体检中心，指的是检查人体健康状况，拥有完整的设备和人力，能检查出身体的疾病和健康评估的场所。在整个初期建设中，要遵循一体化设计的原则，即根据用户实际情况，经过实地考察量身定制，帮助客户组建健康体检中心进而向健康管理中心方向发展。"
                                 ,"操场是供体育锻炼用的场地，多用指学校进行体育活动和教学活动的专置场地。（学习专用）"
                                  ,"河北大学的北口"
    ,"银杏（学名：Ginkgo biloba L.），为银杏科、银杏属落叶乔木。银杏为落叶大乔木。4月开花，10月成熟，种子具长梗，下垂，常为椭圆形、长倒卵形、卵圆形或近圆球形。外种皮肉质，被白粉，外种皮肉质，熟时黄色或橙黄色。 [1] \n" +
            "银杏树又名白果树、公孙树，曾是仅遗存于我国的珍稀树种之一，素有“活化石”之称。银杏树的果实和叶子均有很高的药用价值和食用价值。"
    ,"音乐厅，顾名思义就是音乐的厅堂，是举行音乐会及音乐相关活动的场所，是人们感受音乐魅力的地方。音乐厅通常都装潢典雅，由音乐大厅和小剧场等组成，并配备各种乐器及专业的音乐设备，同时提供舒适的座椅，在优雅的环境里为人们带来音乐的精神盛宴。一座建筑精美风格独特的音乐厅本身就是一件艺术品。"
    ,"图书馆，是搜集、整理、收藏图书资料以供人阅览、参考的机构"
    ,"餐厅，有驴肉火烧，真香！！！！"
    ,"信息学部，风水宝地。"
    ,"花园景观，全是花，挺好看的，没事可以去看看"
    ,"校园东口，出门就是南街。"
    ,"网计学院，我的家，一周7天都想在c1,想住那。"
    ,"校园南口，出门坐车方便。。。"};
    public static CardStackView.ViewHolder viewHolder[] = new CardStackView.ViewHolder[Nodes.length];
    public static int n=0;
}
